package edu.neu.coe.info6205.sort;


import com.ibm.icu.text.Collator;
import edu.neu.coe.info6205.sort.util.FileUtil;
import org.junit.Test;

import java.io.IOException;
import java.util.Arrays;
import java.util.Locale;

import static org.junit.Assert.assertArrayEquals;

public class MSDStringSortTestChinese {

    @Test
    public void sortSeaShells() {
        String[] sortedChinese = new String[]{"阿冰", "阿冰冰", "阿超"};
        String[] unsortedChinese = new String[]{"阿超", "阿冰", "阿冰冰"};
//        String[] sortedChinese = new String[]{"阿滨", "阿春春", "阿丹丹", "阿鼎"};
//        String[] unsortedChinese = new String[]{"阿丹丹", "阿鼎", "阿滨", "阿春春" };
        Arrays.sort(unsortedChinese);
        MSDStringSortChinese.sort(unsortedChinese);
        System.out.println(Arrays.toString(unsortedChinese));
        assertArrayEquals(sortedChinese, unsortedChinese);
    }



    @Test
    public void GeneralTest() throws IOException {
        String[] a = FileUtil.readFileInRange("src/main/resources/shuffledChinese.txt",10);
        String[] b = FileUtil.readFileInRange("src/main/resources/shuffledChinese.txt",10);
        Collator collator = Collator.getInstance(Locale.CHINA);
        Arrays.sort(a,(x1, x2)->collator.compare(x1,x2));
        MSDStringSortChinese.sort(b);


        assertArrayEquals(a, b);

    }

    @Test
    public void GeneralTest1() throws IOException {
        String[] b = FileUtil.readFileInRange("src/main/resources/1000-chinese-words-shuffled.txt",1000);
        String[] a = {"安昌明","安昌荣","安文春","艾学蛟","白春艳","白光瑞","白俊武","白世平","白维维","白兴明","白宇轩","白玉博","鲍思奇","毕景成","边黎明","边珊珊","鲍贤俊","蔡阿凉","蔡德莲","蔡方君","蔡剑霞","蔡萍萍","蔡强国","蔡少宏","蔡世才","蔡体栋","蔡伟杨","蔡晓微","蔡易达","蔡永俊","蔡宗伯","蔡航宇","曹海莹","曹景山","曹坤明","曹乐军","曹一帆","曹玉德","曹春蕾","曹越男","曾繁中","曾海棠","曾少容","曾志国","曾莉莉","查冬梅","柴效武","常福祥","柴文静","陈安芬","陈安刚","陈炳利","陈必强","陈成稳","陈大柱","陈定宇","陈道公","陈二芳","陈冠梅","陈海晖","陈慧琦","陈卉卉","陈进海","陈骏驰","陈敬平","陈可远","陈丽青","陈良国","陈明金","陈能刚","陈培宇","陈庆发","陈仁生","陈淑芳","陈淑欣","陈水林","陈顺波","陈少宇","陈天彪","陈王婧","陈伟基","陈文翰","陈文义","陈锡春","陈旭楠","陈雄钦","陈亚轩","陈扬春","陈怡芬","陈艺清","陈有文","陈钰欣","陈云利","陈幼敏","陈振禄","陈忠彪","陈忠芳","陈祖元","陈绵水","程德清","程红云","程志铭","陈再兴","陈丙军","褚胜男","陈芷慧","丛海龙","崔国柱","崔园园","崔贞媛","崔冠璋","蔡旭泽","戴桂花","戴克祥","戴强华","戴世美","戴燕舞","戴雨农","戴中强","单立楠","党宁宁","代凤兰","邓炳华","邓传宗","邓绍丽","邓文松","邓晓茜","邓智鸿","邓建刚","刁红英","丁经伟","丁菊梅","丁立萍","丁岩岩","董炳华","董光海","董华丽","董俊华","董美娥","董慕云","董其昌","董启文","董瑞利","董向阁","董秀兰","董亚欣","董韵菲","董汉民","杜传芳","杜春雷","杜娜娜","杜强强","杜泉泉","段宏俊","段建华","段忠和","段逸山","窦平平","樊翠霞","樊辉辉","樊建勋","樊玉洁","范爱莉","方成龙","方立东","方日华","房文涛","方竟成","冯德金","冯佳辉","冯敬兰","冯良珍","冯文昊","冯细妹","冯永茂","冯月香","冯泽平","冯珠珠","冯溢君","符旭辉","付朝国","付国兵","傅剑锋","傅美娟","方天禄","高峰山","高洪伟","高佳露","高家榜","高立祥","高民政","高南佳","高伟凯","高文政","高相国","高新怡","高杨军","高义生","高勇勇","高明瀚","高世迎","葛天宇","葛长荣","耿红丽","耿永强","耿旭红","龚文胜","龚子同","顾芳芳","顾伟芬","顾其峰","关凤林","关阳阳","管清霞","郭必强","郭达平","郭芳林","郭惠婷","郭慧英","郭建俊","郭健华","郭建兰","郭凯文","郭丽君","郭树伟","郭松兵","郭天宝","郭天东","郭孝娟","郭雪风","郭晓博","郭亚南","郭云梅","郭云兰","郭增兵","郭子学","郭长坤","郭兆松","郭加华","郭红涛","高君毅","韩昌海","韩纯德","韩德发","韩四国","韩太平","韩孝明","韩长林","郝高飞","郝海玉","郝惠梅","郝晓斌","郝雅婷","郝振英","韩瑞发","何锋涛","何观秀","何华容","何惠贞","何丽贞","何明洋","何三华","何廷华","何文元","何文贞","何瑶卿","和志武","何永宽","贺建清","贺婉莹","贺文佳","贺旭军","贺子清","何远明","洪超群","洪文胜","洪雯雯","洪新发","洪金明","胡才学","胡春力","胡洪燕","胡家聪","胡锦丽","胡梦远","胡瑞芝","胡素华","胡文彬","胡贤安","胡彦伶","胡远征","胡振全","胡忠健","胡日光","华福雄","华佳丽","黄安全","黄成才","皇甫新","黄广全","黄浩华","黄浩鹏","黄宏良","黄红忠","黄继芬","黄洁仪","黄龙堂","黄秋琴","黄如松","黄斯琪","黄三花","黄腾亿","黄卫昌","黄锡鸿","黄一秀","黄英德","黄有珍","黄玉婷","黄长宝","黄治勇","黄志豪","黄凤芬","黄金财","黄世梁","黄佳慧","霍学东","黄花龙","黄继海","季圣杰","纪明强","贾春婷","贾玉卓","贾高峰","江德英","江明华","江兴流","江玉海","姜贝贝","姜国庆","姜洁琼","姜金枝","蒋春英","蒋君南","蒋开文","蒋伟刚","蒋志振","蒋自何","姜成君","蒋应东","贾明生","解子瑶","解永生","金景花","金明辉","靳海英","景红红","景燕燕","金栋栋","江永超","金惠贞","康朝锋","康敬东","柯铭峰","孔繁贵","孔庆汉","寇东亮","邝少明","康旭龙","赖观生","赖洪平","赖淑珍","兰素珍","蓝灿荣","蓝文富","赖金金","雷富强","雷琼珍","雷体华","雷媛媛","雷婧婧","黎锦芳","黎少莲","黎艳丽","黎江江","李爱芝","李碧伟","李冰琦","李炳坚","李才广","李承承","李春磊","李灿权","李德举","李恩军","李奉明","李国立","李恒武","李虎山","李加鹏","李佳木","李江为","李金方","李晋吉","李经方","李敬娜","李开彬","李来寿","李力勤","李良建","李老虎","李佩泽","李萍进","李沁阳","李容华","李山峰","李尚成","李世良","李松山","李世艳","李天初","李廷光","李天柱","李万亮","李为福","李维颖","李晓亭","李晓钟","李新浩","李耀佳","李业平","李咏玲","李雨珍","李英权","李志经","李禹贤","梁成源","梁凤超","梁谷晨","梁国新","梁嘉彬","廖福涛","廖国林","廖华琼","廖石娣","廖文秀","梁明珠","林伯前","林春子","林聪标","林德宏","林辉煌","林嘉慧","林江南","林俊豪","林景堂","林昆翰","林明广","林品桦","林庆霞","林淑平","林文瀚","林新春","林义锋","林永传","凌云鹤","凌国英","林震天","刘柏江","刘成光","刘持平","刘翠婵","刘成先","刘发建","刘贵鹏","刘桂鸿","刘辉兵","刘海桃","刘吉秀","刘继坤","刘建真","刘嘉鸿","刘美勤","刘美枝","刘敏凤","刘青荣","刘荣乐","刘书奎","刘树利","刘思建","刘思祥","刘思言","刘思凤","刘万琼","刘万友","刘旺兴","刘溪平","刘向荣","刘晓永","刘秀华","刘雪荣","刘先伟","刘亚赛","刘依涵","刘英玉","刘展强","刘仲健","刘子学","刘中兵","刘玉书","柳向荣","刘恩成","刘书琳","娄苗苗","卢向军","卢月月","卢云超","卢丹妮","鲁燕燕","陆晨玮","陆福士","陆鹤龄","陆晓飞","陆志云","陆子艺","陆仁甲","吕恩谊","吕鸿涛","吕建锋","吕鹏宇","吕卫红","吕新年","吕延杰","吕一冰","吕学政","栾琳琳","罗国丽","罗进军","罗庆富","罗如君","罗三春","罗文文","罗志玉","罗云忠","罗岚岚","陆新元","麻寅生","马成军","马翠玉","马韩儿","马航宇","马家边","马梦迪","马树清","马铁生","马文春","马文凤","马兴民","马旭刚","马富才","毛燕华","马安英","孟淑华","孟祥江","梅艳丽","缪国祥","穆琳琳","莫松霖","南云霞","宁静儿","牛桂花","牛莲花","牛银玲","聂和平","欧晓兰","欧阳震","潘国芬","潘海荣","潘文斌","潘秀茹","潘佩玉","裴凤丽","裴秀红","彭华林","彭利梅","彭良芳","彭梦圆","彭巧华","彭淑敏","彭晓苓","彭艳娥","彭玉春","彭淑芬","潘凤华","祁晓翔","钱桂萍","钱桂云","钱莎莎","乔佳佳","乔世军","秦倩茹","邱德兴","邱连杰","邱梦瑜","邱日忠","曲东阳","屈磊磊","曲俊娜","饶育蕾","任会平","任佳宁","任健强","任俊伟","任兰枝","任文胜","任玉春","任月月","任欢欢","荣凤毅","阮方民","阮开培","芮誉之","芮子骞","任国升","桑旭东","沙洪涛","商永柯","尚学辉","尚永锋","尚宇杰","邵登科","邵树强","邵晓梅","尚永杰","佘学文","申雪莹","沈娇阳","沈志辉","沈周林","沈子明","沈大斌","施宏燕","施孟奇","施英华","石文良","石学飞","时倩倩","时少华","史宏达","石玉林","舒冬梅","舒乐乐","尚丽娟","司萍萍","宋炳玉","宋建文","宋培亮","宋士奎","宋树成","宋学民","宋雪光","宋金全","苏春凤","苏丹平","苏会敏","苏元平","苏红军","隋丽媛","孙保营","孙承丽","孙二龙","孙公照","孙海轩","孙华兴","孙京春","孙建庭","孙龙霞","孙明科","孙思宇","孙淑晶","孙岳明","孙玉茜","孙长军","孙竹青","孙长申","孙哲哲","孙宜林","孙金婷","申迎春","谭家健","谭美琼","谭浩宇","汤福锦","汤洪波","汤惠休","汤文红","汤爱民","唐海岩","唐宏达","唐建容","唐少林","唐天虎","唐新兰","唐业成","唐泽辉","唐祖平","唐春刚","唐园园","唐士其","陶淑娟","陶思齐","谭思琪","滕海波","滕桂春","田红峰","田仁刚","田晓晓","田雪雪","田一男","田贞见","田平芳","佟明鑫","汤梓婷","万跃东","万军伟","汪昌云","汪清兰","汪亚龙","汪玉秀","汪子璇","汪国建","王本宗","王承佳","王翠娥","王承宇","王大贵","王代福","王殿臣","王鼎元","王广风","王桂良","王国照","王红金","王红研","王红一","王宏敏","王华圣","王靖鑫","王居龙","王姣龙","王克武","王来明","王路波","王立静","王妙英","王名英","王明湖","王琴波","王麒英","王绍瑛","王诗卉","王世骏","王树川","王树来","王思逸","王卫光","王武全","王万明","王喜旺","王仙芳","王香娥","王香凝","王筱燕","王新晨","王修德","王学振","王贤福","王雅星","王燕玉","王永昭","王宇新","王岳军","王业根","王泽鉴","王兆会","王中良","王忠芝","王仲谋","王宗盛","王泽红","王用予","汪亚洲","王天赐","汪英姿","韦超强","韦立颖","韦丽萍","魏成兰","魏宏强","魏仁体","魏雯霞","温泉铭","温淑琴","翁雅丽","韦超杰","巫玉华","吴春容","吴春桃","吴冲龙","吴达海","吴鼎立","吴丁丁","吴富平","吴关雄","吴弘毅","吴红雷","吴景红","吴嘉宸","吴龙亮","吴良芳","吴美龄","吴明晶","吴名星","吴儒军","吴尚刚","吴善昌","吴宛谕","吴艳妮","吴一武","吴银祥","吴迎平","吴正格","吴忠琪","吴子章","吴宗学","吴作杰","吴克伦","武俊生","武晴晴","武星华","吴智斌","王治心","席文文","夏春花","夏军勇","向璐璐","向雪怀","萧友梅","肖飞虎","肖桂杰","肖宏涛","肖可人","肖蕾蕾","肖世俊","肖寿华","肖晓兰","肖兴福","肖亚新","谢俊义","谢瑞祥","谢少燕","谢晓飞","谢新垒","谢逸平","谢永春","谢又红","谢运泉","谢紫彬","谢秋如","辛颖梅","熊海洲","熊启英","修洋洋","谢发德","徐宝宏","徐本强","徐大卫","徐德华","徐贯志","徐华才","徐佳玲","徐琳玉","徐鸣涧","徐清山","徐启胜","徐世兵","徐士龙","徐晓秋","徐先兰","徐燕美","徐玉宝","徐志森","徐中豪","徐康清","许春美","许道华","许大朋","许凤山","许金富","许家芳","许利强","许琳华","许立伟","许腾飞","许文昭","许学红","许雅雅","许英伟","许源源","许庆鑫","薛子华","徐永江","熊文富","鄢福生","闫丽军","严大军","严丹虹","颜春林","杨碧芳","杨宝善","杨春娇","杨东红","杨德政","杨红星","阳厚忠","杨继利","杨家欣","杨腊香","杨利春","杨令军","杨配裕","杨仁凯","杨桑桑","杨圣彬","杨栓保","杨胜文","杨维建","杨晓嘉","杨心红","杨新容","杨欣荣","杨玉春","杨钰峰","杨煜萍","杨远林","杨振富","杨正兵","杨庆聪","杨镇玮","杨文年","姚宝根","姚溪敏","姚新峰","姚雪娥","杨赛峰","叶福前","叶国伟","叶敏洁","叶巧蕊","叶仁辉","叶珊涛","叶晓挺","叶育生","叶子立","叶厚朴","易超波","易先明","殷世鹏","尹春英","尹干洪","于立波","于生文","于时雨","余桂荣","余海兵","余浩东","余路明","余述平","俞利英","俞燕华","俞月凤","俞长峰","虞晓静","俞海涛","喻春芳","袁碧琴","袁国跃","袁继鹏","袁文锋","袁仲一","袁爱花","岳红杰","岳爱民","宇文宪","杨力波","翟佳丽","翟玉红","臧俊杰","臧燕燕","詹心怡","翟燕青"};
        Collator collator = Collator.getInstance(Locale.CHINA);
        MSDStringSortChinese.sort(b);

        assertArrayEquals(a, b);

    }
}
